In [ ]:
import pandas as pd

df = pd.read_csv('jobs.csv')

df.head()

,title,date,company,location,salary
0,Data Engineer,16 December 2025,Hunter Selection Limited,"Birmingham, West Midlands, B4 7AE","£50,000 to £65,000 per year"
1,Data Engineer,03 December 2025,NHS Jobs,"Preston, PR2 9WT",Negotiable
2,Data Engineer,09 December 2025,Government Recruitment Service,RG1 7EB,"£57,353 per year"
3,Data Engineer,18 November 2025,Ecruit,London,"£50,000 to £60,000 per year"
4,Data Engineer,09 December 2025,Co-op Group,"Manchester, Greater Manchester, M60 0AG","£45,000 to £55,000 per year"
5,Data Engineer,11 December 2025,Government Recruitment Service,Glasgow,"£69,308 per year"
6,Data Engineer,11 December 2025,Government Recruitment Service,"Manchester, Greater Manchester","£69,308 per year"
7,Data Engineer,11 December 2025,Government Recruitment Service,"Newcastle Upon Tyne, Tyne & Wear","£69,308 per year"
8,Data Engineer,11 December 2025,Government Recruitment Service,"York, North Yorkshire","£69,308 per year"
9,Data Engineer,25 November 2025,The Big Life Group,"Manchester, M15 4ZY",Competitive – to be negotiated

In [39]:
#standardized date 
df['date']= pd.to_datetime(df['date'], errors = 'coerce')

df.head(10)

,title,date,company,location,salary
0,Data Engineer,2025-12-16,Hunter Selection Limited,"Birmingham, West Midlands, B4 7AE","£50,000 to £65,000 per year"
1,Data Engineer,2025-12-03,NHS Jobs,"Preston, PR2 9WT",Negotiable
2,Data Engineer,2025-12-09,Government Recruitment Service,RG1 7EB,"£57,353 per year"
3,Data Engineer,2025-11-18,Ecruit,London,"£50,000 to £60,000 per year"
4,Data Engineer,2025-12-09,Co-op Group,"Manchester, Greater Manchester, M60 0AG","£45,000 to £55,000 per year"
5,Data Engineer,2025-12-11,Government Recruitment Service,Glasgow,"£69,308 per year"
6,Data Engineer,2025-12-11,Government Recruitment Service,"Manchester, Greater Manchester","£69,308 per year"
7,Data Engineer,2025-12-11,Government Recruitment Service,"Newcastle Upon Tyne, Tyne & Wear","£69,308 per year"
8,Data Engineer,2025-12-11,Government Recruitment Service,"York, North Yorkshire","£69,308 per year"
9,Data Engineer,2025-11-25,The Big Life Group,"Manchester, M15 4ZY",Competitive – to be negotiated

In [49]:
df.describe()

                      date
count                   10
mean   2025-12-06 09:36:00
min    2025-11-18 00:00:00
25%    2025-12-04 12:00:00
50%    2025-12-10 00:00:00
75%    2025-12-11 00:00:00
max    2025-12-16 00:00:00

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   title     10 non-null     object
 1   date      10 non-null     datetime64[ns]
 2   company   10 non-null     object
 3   location  10 non-null     object
 4   salary    10 non-null     object
 5   postcode  5 non-null      object
dtypes: datetime64[ns](1), object(5)
memory usage: 612.0+ bytes

In [ ]:
#salary extraction
#  Clean salary text
df['salary_clean'] = (
    df['salary']
    .str.replace(',', '', regex=False)
    .str.replace('£', '', regex=False)
)

# Extract minimum salary (first number)
df['min_salary'] = df['salary_clean'].str.extract(r'(\d+)').astype(float)

#  Extract maximum salary (second number if exists, else same as min)
df['max_salary'] = df['salary_clean'].str.extract(r'\d+\s*to\s*(\d+)').astype(float)
df['max_salary'] = df['max_salary'].fillna(df['min_salary'])

#  Get overall min + max
overall_min = df['min_salary'].min()
overall_max = df['max_salary'].max()

In [76]:
df.drop(columns=['salary'], inplace=True)
df.drop(columns=['salary_clean'], inplace=True)

In [77]:
df.head()

,title,date,company,location,min_salary,max_salary
0,Data Engineer,16 December 2025,Hunter Selection Limited,"Birmingham, West Midlands, B4 7AE",50000.0,65000.0
1,Data Engineer,03 December 2025,NHS Jobs,"Preston, PR2 9WT",NaN,NaN
2,Data Engineer,09 December 2025,Government Recruitment Service,RG1 7EB,57353.0,57353.0
3,Data Engineer,18 November 2025,Ecruit,London,50000.0,60000.0
4,Data Engineer,09 December 2025,Co-op Group,"Manchester, Greater Manchester, M60 0AG",45000.0,55000.0

In [78]:
import pandas as pd
import re

# Extract postcode using UK postcode pattern
postcode_pattern = r'([A-Z]{1,2}\d[A-Z\d]?\s*\d[A-Z]{2})'
df['postcode'] = df['location'].str.extract(postcode_pattern)

# Extract city name (everything before the first comma)
df['location'] = df['location'].str.split(',').str[0].str.strip()

In [81]:
df.head()

,title,date,company,location,min_salary,max_salary,postcode
0,Data Engineer,16 December 2025,Hunter Selection Limited,Birmingham,50000.0,65000.0,B4 7AE
1,Data Engineer,03 December 2025,NHS Jobs,Preston,NaN,NaN,PR2 9WT
2,Data Engineer,09 December 2025,Government Recruitment Service,RG1 7EB,57353.0,57353.0,RG1 7EB
3,Data Engineer,18 November 2025,Ecruit,London,50000.0,60000.0,NaN
4,Data Engineer,09 December 2025,Co-op Group,Manchester,45000.0,55000.0,M60 0AG

In [ ]:
# columns rearrangement
df=df[['title', 'company','date','location','postcode','min_salary','max_salary']]

df.head()

,title,company,date,location,postcode,min_salary,max_salary
0,Data Engineer,Hunter Selection Limited,16 December 2025,Birmingham,B4 7AE,50000.0,65000.0
1,Data Engineer,NHS Jobs,03 December 2025,Preston,PR2 9WT,NaN,NaN
2,Data Engineer,Government Recruitment Service,09 December 2025,RG1 7EB,RG1 7EB,57353.0,57353.0
3,Data Engineer,Ecruit,18 November 2025,London,NaN,50000.0,60000.0
4,Data Engineer,Co-op Group,09 December 2025,Manchester,M60 0AG,45000.0,55000.0

In [15]:
df.isnull().sum()

title       0
date        0
company     0
location    0
salary      0
dtype: int64

In [ ]:
# saved the cleaned data
df.to_csv('cleaned_jobs.csv')

In [85]:
df.head(11)

,title,company,date,location,postcode,min_salary,max_salary
0,Data Engineer,Hunter Selection Limited,16 December 2025,Birmingham,B4 7AE,50000.0,65000.0
1,Data Engineer,NHS Jobs,03 December 2025,Preston,PR2 9WT,NaN,NaN
2,Data Engineer,Government Recruitment Service,09 December 2025,RG1 7EB,RG1 7EB,57353.0,57353.0
3,Data Engineer,Ecruit,18 November 2025,London,NaN,50000.0,60000.0
4,Data Engineer,Co-op Group,09 December 2025,Manchester,M60 0AG,45000.0,55000.0
5,Data Engineer,Government Recruitment Service,11 December 2025,Glasgow,NaN,69308.0,69308.0
6,Data Engineer,Government Recruitment Service,11 December 2025,Manchester,NaN,69308.0,69308.0
7,Data Engineer,Government Recruitment Service,11 December 2025,Newcastle Upon Tyne,NaN,69308.0,69308.0
8,Data Engineer,Government Recruitment Service,11 December 2025,York,NaN,69308.0,69308.0
9,Data Engineer,The Big Life Group,25 November 2025,Manchester,M15 4ZY,NaN,NaN

In [33]:
import pandas as pd

%pip install sqlalchemy psycopg2 pandas



from sqlalchemy import create_engine

Requirement already satisfied: sqlalchemy in c:\users\joynm\downloads\data_eng.py\venv\lib\site-packages (2.0.45)
Collecting psycopg2
  Using cached psycopg2-2.9.11-cp313-cp313-win_amd64.whl.metadata (5.1 kB)
Requirement already satisfied: pandas in c:\users\joynm\downloads\data_eng.py\venv\lib\site-packages (2.3.3)
Requirement already satisfied: greenlet>=1 in c:\users\joynm\downloads\data_eng.py\venv\lib\site-packages (from sqlalchemy) (3.3.0)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\joynm\downloads\data_eng.py\venv\lib\site-packages (from sqlalchemy) (4.15.0)
Requirement already satisfied: numpy>=1.26.0 in c:\users\joynm\downloads\data_eng.py\venv\lib\site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\joynm\downloads\data_eng.py\venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\joynm\downloads\data_eng.py\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\joynm\downloads\data_eng.py\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\joynm\downloads\data_eng.py\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Using cached psycopg2-2.9.11-cp313-cp313-win_amd64.whl (2.7 MB)
Installing collected packages: psycopg2
Successfully installed psycopg2-2.9.11
Note: you may need to restart the kernel to use updated packages.

In [86]:
db_config = {
    'host': 'localhost',
    'port': '5433',
    'database': 'Data_Engineer_jobs',
    'username': 'postgres',
    'password': 'amaka',
    
}
connection_string = (
    f"postgresql://{db_config['username']}:{db_config['password']}@"
    f"{db_config['host']}:{db_config['port']}/{db_config['database']}"
)
engine = create_engine(connection_string)

try:
    with engine.connect() as conn:
        print("✅ Connection successful!")
except Exception as e:
    print("❌ Connection failed:", e)

from sqlalchemy import create_engine

✅ Connection successful!

In [88]:
df.to_sql('jobs_opening',engine, if_exists='replace', index=False)

print("data loaded into postgrestsql successfully")

data loaded into postgrestsql successfully